{"version":"1","records":[{"hierarchy":{"lvl1":"Curriculum Vitae"},"type":"lvl1","url":"/cv","position":0},{"hierarchy":{"lvl1":"Curriculum Vitae"},"content":"Name: Alex Do\nEmail: \n\nalex.do@email.com\nLocation: New York, NY","type":"content","url":"/cv","position":1},{"hierarchy":{"lvl1":"Curriculum Vitae","lvl2":"Summary:"},"type":"lvl2","url":"/cv#summary","position":2},{"hierarchy":{"lvl1":"Curriculum Vitae","lvl2":"Summary:"},"content":"As a data scientist with a PhD degree and 5 years of work experience (see my \n\neducation, I have a deep understanding of statistical modeling, machine learning, and data visualization (more details in \n\nskills section). My career has been focused on solving complex business problems through the use of data-driven insights, and I have a proven track record of delivering measurable results (see \n\nprofessional experience section). Example of my work can be found \n\nhere.","type":"content","url":"/cv#summary","position":3},{"hierarchy":{"lvl1":"Curriculum Vitae","lvl2":"Education:"},"type":"lvl2","url":"/cv#education","position":4},{"hierarchy":{"lvl1":"Curriculum Vitae","lvl2":"Education:"},"content":"PhD in Computer Science, New York University, 2013-2018\n\nMS in Computer Science, University of California, Los Angeles, 2011-2013\n\nBS in Computer Science, University of Illinois at Urbana-Champaign, 2007-2011","type":"content","url":"/cv#education","position":5},{"hierarchy":{"lvl1":"Curriculum Vitae","lvl2":"Skills:"},"type":"lvl2","url":"/cv#skills","position":6},{"hierarchy":{"lvl1":"Curriculum Vitae","lvl2":"Skills:"},"content":"Strong knowledge of statistical modeling and machine learning techniques\n\nExpertise in data cleaning, feature engineering, and model selection\n\nProficient in programming languages including Python, R, and SQL\n\nExperience with data analysis tools such as Tableau and PowerBI\n\nExcellent project management skills with experience leading cross-functional teams\n\nStrong communication and presentation skills with the ability to convey complex data insights to both technical and non-technical audiences","type":"content","url":"/cv#skills","position":7},{"hierarchy":{"lvl1":"Curriculum Vitae","lvl2":"Professional Experience:"},"type":"lvl2","url":"/cv#experience","position":8},{"hierarchy":{"lvl1":"Curriculum Vitae","lvl2":"Professional Experience:"},"content":"Data Scientist, ABC Corporation, New York, NY, 2018-present\n\nLead data scientist for a team of five data scientists working on projects in finance, healthcare, and retail industries\n\nDeveloped machine learning models to predict customer churn and identify upsell opportunities for a retail client, resulting in a 20% increase in revenue\n\nCreated a dashboard to visualize customer engagement metrics for a healthcare client, resulting in a 15% increase in patient satisfaction scores\n\nConducted data analysis and provided recommendations to executive leadership on strategic initiatives\n\nMentored junior data scientists on best practices for data analysis and machine learning\n\nData Scientist, XYZ Corporation, Los Angeles, CA, 2016-2018\n\nConducted data analysis to identify opportunities for cost savings in the supply chain, resulting in a 10% reduction in supply chain costs\n\nDeveloped machine learning models to predict customer behavior for a financial client, resulting in a 25% increase in loan approvals\n\nCreated a dashboard to visualize key performance metrics for a marketing campaign, resulting in a 30% increase in conversions\n\nCollaborated with cross-functional teams to develop and implement data-driven solutions\n\nData Analyst, DEF Corporation, Urbana-Champaign, IL, 2011-2016\n\nConducted data analysis to identify opportunities for process improvement in manufacturing operations\n\nCreated reports and dashboards to visualize key performance metrics for executive leadership\n\nCollaborated with cross-functional teams to implement process improvements","type":"content","url":"/cv#experience","position":9},{"hierarchy":{"lvl1":"Curriculum Vitae","lvl2":"Certifications:"},"type":"lvl2","url":"/cv#certifications","position":10},{"hierarchy":{"lvl1":"Curriculum Vitae","lvl2":"Certifications:"},"content":"To satisfy my eagerness for knowledge, I enroll in online courses in areas of Artificial Intelligence and Software Engineering that pique my interest and undertake independent projects during my leisure hours. A few examples of such projects include:\n\nMicrosoft Certified: Azure Data Scientist Associate\n\nAWS Certified: Machine Learning – Specialty\n\nDeep Learning Specialization - Coursera\n\nMachine Learning Engineer Nanodegree - Udacity\n\nReact Nanodegree - Udacity\n\nStatistics Specialization: Introduction to Probability and Data, Inferential Statistics - by Duke University - Coursera\n\nPython Data Science and Machine Learning Bootcamp - Udemy\n\nMathematics for Machine Learning Specialization - Coursera","type":"content","url":"/cv#certifications","position":11},{"hierarchy":{"lvl1":"Curriculum Vitae","lvl2":"Publications:"},"type":"lvl2","url":"/cv#publications","position":12},{"hierarchy":{"lvl1":"Curriculum Vitae","lvl2":"Publications:"},"content":"Smith, J., and Jones, L. “A Comparative Analysis of Machine Learning Techniques for Predicting Customer Churn,” Journal of Data Science, Vol. 5, No. 2, 2019.","type":"content","url":"/cv#publications","position":13},{"hierarchy":{"lvl1":"Curriculum Vitae","lvl2":"Professional Memberships:"},"type":"lvl2","url":"/cv#professional-memberships","position":14},{"hierarchy":{"lvl1":"Curriculum Vitae","lvl2":"Professional Memberships:"},"content":"Member, Data Science Association\n\nMember, American Statistical Association\n\nMember, Institute of Electrical and Electronics Engineers (IEEE)","type":"content","url":"/cv#professional-memberships","position":15},{"hierarchy":{"lvl1":"About Me:"},"type":"lvl1","url":"/about-me","position":0},{"hierarchy":{"lvl1":"About Me:"},"content":"Dear Hiring Manager,\n\nI am excited to apply for the data scientist position at your company. With a PhD degree and 5 years of experience in statistical modeling, machine learning, and data visualization, I have developed a strong foundation in data-driven insights and problem-solving.\n\nThroughout my career, I have been driven by a passion for uncovering insights and driving change through data analysis. I am always looking for new challenges and opportunities to apply my skills and expertise to solve complex business problems.\n\nAs a skilled practitioner of supervised and unsupervised machine learning techniques, I am confident in my ability to deliver measurable results through data cleaning, feature engineering, and model selection. I am comfortable with a variety of data types, including structured, unstructured, and semi-structured data, and am proficient in multiple programming languages and data analysis tools, such as Python, R, SQL, and Tableau.\n\nWarning\n\nWith my ability to work under pressure and manage multiple projects simultaneously while maintaining a high level of attention to detail, I am a proven asset to any fast-paced team.\n\nThroughout my career, I have worked in diverse industries, including finance, healthcare, and retail, where I have gained experience working with cross-functional teams and communicating complex data insights to technical and non-technical stakeholders. I am adept at translating data-driven insights into actionable recommendations that drive business outcomes.\n\nNote\n\nAs a committed project manager, I have led cross-functional teams and maintained a focus on high-quality work to exceed expectations. As an active member of the data science community, I enjoy participating in conferences and networking events to expand my knowledge and share my insights with others.\n\nQuote from Tim Berners-Lee\n\n“Data is a precious thing and will last longer than the systems themselves.”\n\nIn summary, I bring a passion for data analysis, a wealth of technical expertise, project management skills, and cross-functional experience to any organization as a data scientist. I am excited about the opportunity to continue to grow and develop in my field, and I look forward to the possibility of contributing to your team.\n\nThank you for considering my application.","type":"content","url":"/about-me","position":1},{"hierarchy":{"lvl1":"Titanic Dataset: Exploratory Data Analysis"},"type":"lvl1","url":"/analysis-example","position":0},{"hierarchy":{"lvl1":"Titanic Dataset: Exploratory Data Analysis"},"content":"\n\nFigure 1:Titanic image downloaded from wikimedia\n\nThis is an EDA of the famous Titanic (shown in \n\nFigure 1) dataset from Kaggle. Through EDA, I will  try to achive the following goals:\n\nInvestigate the demographic characteristics of the Titanic’s passengers, such as their age, gender, and social class, to gain a better understanding of the composition of the passenger list.\n\nExplore the origins of the Titanic’s passengers, including their countries of origin, to gain a better understanding of the cultural diversity of the passenger list.\n\nDetermine which passengers traveled with their families and which ones traveled alone to gain insights into the social dynamics of the passengers.\n\nimport pandas as pd\nimport numpy as np\nimport matplotlib.pyplot as plt\nimport seaborn as sns\n\n\n\n# load the dataset.\ntitanic_df = pd.read_csv('data/titanic_train.csv')\n# preview your dataset\ntitanic_df.head() \n\n\n\n# information about the dataset. \ntitanic_df.info()\n\n\n\n","type":"content","url":"/analysis-example","position":1},{"hierarchy":{"lvl1":"Titanic Dataset: Exploratory Data Analysis","lvl2":"Demographic characteristics of the Titanic’s passengers"},"type":"lvl2","url":"/analysis-example#demographic-characteristics-of-the-titanics-passengers","position":2},{"hierarchy":{"lvl1":"Titanic Dataset: Exploratory Data Analysis","lvl2":"Demographic characteristics of the Titanic’s passengers"},"content":"Let’s look at some demographical information about the passengers.\n\nLet’s take a look at socio-economic class of a person (Pclass column)\n\nsns.catplot(x='Pclass',data=titanic_df,hue='Sex',kind='count')\n\n\n\n\n\nLet’s explore passangers’ gender:\n\n# number of male and female passengers\nsns.catplot(x='Sex',data=titanic_df,kind='count')\n\n\n\n\n\nFigure summary: there were considerably more male passengers onboard.\n\nNote: It is important to acknowledge that gender is not binary and that there are many individuals who do not identify as strictly male or female. However, the dataset available for the Titanic passengers only includes information on male and female passengers. While this limitation may not fully capture the diversity of gender identities among the passengers, it is still valuable in providing insights into the demographics and social dynamics of the Titanic’s passengers.\n\nLet’s now figure out how many kids were on the Titanic:\n\n# function to create category child\ndef child(df):\n    sex=df['Sex']\n    age=df['Age']\n    \n    return 'child' if age < 16 else sex\n\n# create a new column \"Individuals\"\ntitanic_df['Individuals'] = titanic_df.apply(child,axis=1)\n# see counts\nprint(titanic_df['Individuals'].value_counts())\n\n\n\nNow, let’s check teh distribution of men, women and children belonging to different socio-economic classes.\n\nsns.catplot(x='Pclass',data=titanic_df,hue='Individuals',kind='count')\n\n\n\n\n\nFigure summary: There are way more male passengers than woman or childeren in the 3rd class than in any other class.\n\nLet’s check out how the age distribution varies for different classes\n\nage_class = sns.FacetGrid(titanic_df,hue='Pclass',aspect=2)\nage_class.map(sns.kdeplot,'Age',fill=True)\noldest = titanic_df['Age'].max()\nage_class.set(xlim=(0,oldest))\nage_class.add_legend()\n\n\n\n\n\nFigure summary: first class passengers were older that passagenrs of other class\n\n","type":"content","url":"/analysis-example#demographic-characteristics-of-the-titanics-passengers","position":3},{"hierarchy":{"lvl1":"Titanic Dataset: Exploratory Data Analysis","lvl2":"Explore the origins of the Titanic’s passengers"},"type":"lvl2","url":"/analysis-example#explore-the-origins-of-the-titanics-passengers","position":4},{"hierarchy":{"lvl1":"Titanic Dataset: Exploratory Data Analysis","lvl2":"Explore the origins of the Titanic’s passengers"},"content":"\n\nThe Embarked columns are abbreviation of the following port of embarkation:\n\nC = Cherbourg\n\nQ = Queenstown\n\nS = Southampton\n\nsns.catplot(x='Embarked',data=titanic_df,hue='Pclass',kind='count')\n\n\n\n\n\nFigure summary: Most of the 3rd class passengers embarked from Southampton\n\n","type":"content","url":"/analysis-example#explore-the-origins-of-the-titanics-passengers","position":5},{"hierarchy":{"lvl1":"Titanic Dataset: Exploratory Data Analysis","lvl2":"Determine which passengers traveled with their families"},"type":"lvl2","url":"/analysis-example#determine-which-passengers-traveled-with-their-families","position":6},{"hierarchy":{"lvl1":"Titanic Dataset: Exploratory Data Analysis","lvl2":"Determine which passengers traveled with their families"},"content":"\n\nwe need 2 columns:\n\nSibsSP : number of siblings or spouses that a passenger had aboard.\n\nParch : number of parents or children someone had on the ship.\n\nWe can combine teh column to determine whetehr the passanger was alone or with someone and record in in ModeofTravel column:\n\n#Adding the number of family a passenger had onboard\ntitanic_df['ModeofTravel'] = titanic_df.SibSp + titanic_df.Parch\ntitanic_df['ModeofTravel'] = titanic_df['ModeofTravel'].apply(lambda x: 'With Someone' if x > 0 else 'Alone')\n\n\n\nsns.catplot(x='ModeofTravel',data=titanic_df,kind='count')\n\n\n\n\n\nFigure summary: The majority of people on the ship travled with someone.","type":"content","url":"/analysis-example#determine-which-passengers-traveled-with-their-families","position":7},{"hierarchy":{"lvl1":"Acknowledgments"},"type":"lvl1","url":"/citations","position":0},{"hierarchy":{"lvl1":"Acknowledgments"},"content":"The image of the data scientist was generated using AI-powered face generator that produces photos of people who do not exist at a resolution of 1024x1024 pixels. \n\nChatGPT (2022)\n\nThe contents of CV and Cover letter are modified from the output generated by ChatGPT. \n\nthispersondoesnotexist (2022)","type":"content","url":"/citations","position":1},{"hierarchy":{"lvl1":"Acknowledgments","lvl2":"References"},"type":"lvl2","url":"/citations#references","position":2},{"hierarchy":{"lvl1":"Acknowledgments","lvl2":"References"},"content":"","type":"content","url":"/citations#references","position":3},{"hierarchy":{"lvl1":"Digital Portfolio"},"type":"lvl1","url":"/","position":0},{"hierarchy":{"lvl1":"Digital Portfolio"},"content":"Check out the content pages bundled with this sample book to see more.\n\n\n\nJupyter Book V2 has some significant differences from earlier versions\n\nMarkdown has a lot of great formatting options that are easy to use once familiar with the syntax\n\nPerseverence is key to troubleshooting. Chatbots are not that helpful unless one already has some domain knowledge.\n\nFiguring out the new Jupyter Book commands for V2\n\nInserting a stable content image\n\nTroubleshooting errors","type":"content","url":"/","position":1}]}